/**
 * Класс предназначен для демонстрации работы утилиты Javadoc
 * в рамках выполнения практических работ по java.
 *
 * @author Чечелев Роман
 * @version 1.0
 * @since 2026-06-07
 */
public class Main {

    /**
     * Вычисляет сумму двух целых чисел.
     * <p>
     * Это подробное описание метода, где можно указать детали
     * реализации или особенности работы.
     *
     * @param a первое слагаемое
     * @param b второе слагаемое
     * @return сумма параметров a и b
     * @throws IllegalArgumentException если параметры некорректны (пример)
     */
    public int sum(int a, int b) {
        return a + b;
    }
}